### [참고] <a href="https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf">Pandas Cheat Sheet</a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(
    {
        "영어":[60,70],
        "수학":[100,50]
    }, index=["Hong","Kim"]
)
df

      영어   수학
Hong  60  100
Kim   70   50

In [3]:
def func1(df):
    print(df.values)

In [5]:
df.values

array([[ 60, 100],
       [ 70,  50]], dtype=int64)

In [6]:
# apply(): 데이터프레임에 함수 적용, 함수는 어느 방향으로 적용시킬 것인가?
df.apply(func1)

[60 70]
[100  50]

영어    None
수학    None
dtype: object

<img src='https://www.w3resource.com/w3r_images/pandas-dataframe-apply-1.png' width="300" height="150">

In [7]:
df.apply(func1,axis=1) # 옆으로 출력

[ 60 100]
[70 50]

Hong    None
Kim     None
dtype: object

<img src="https://www.w3resource.com/w3r_images/pandas-dataframe-apply-2.png" width="300" height="200">

In [8]:
# 영어 점수를 80으로 수정
def func2(data):
    data["영어"]=80
    return data

In [10]:
df_func2 = df.apply(func2,axis=1)
df_func2

      영어   수학
Hong  80  100
Kim   80   50

<img src="https://www.w3resource.com/w3r_images/pandas-dataframe-apply-3.png">

In [11]:
df2 = pd.DataFrame([[9,25]] * 3, columns=["P","Q"])
df2

   P   Q
0  9  25
1  9  25
2  9  25

In [12]:
df2.apply(np.sqrt)

     P    Q
0  3.0  5.0
1  3.0  5.0
2  3.0  5.0

In [13]:
df2.apply(np.sum)

P    27
Q    75
dtype: int64

In [14]:
df2.apply(np.sqrt,axis=1)

     P    Q
0  3.0  5.0
1  3.0  5.0
2  3.0  5.0

In [15]:
df2.apply(np.sum,axis=1)

0    34
1    34
2    34
dtype: int64

In [16]:
date_list = {"yyyy-mm-dd":["2005-09-28","2007-10-05","2012-12-20"]}
df = pd.DataFrame(date_list)
df

   yyyy-mm-dd
0  2005-09-28
1  2007-10-05
2  2012-12-20

In [17]:
# 년도만 잘라서 리턴
def extract_year(col):
    return col.split("-")[0]

In [21]:
df["year"] = df["yyyy-mm-dd"].apply(extract_year)
df

   yyyy-mm-dd  year
0  2005-09-28  2005
1  2007-10-05  2007
2  2012-12-20  2012

In [28]:
# 나이 컬럼 추가
def get_age(year, cur_year):
    return cur_year - int(year)

In [29]:
df['age'] = df['year'].apply(get_age,cur_year=2023)
df

   yyyy-mm-dd  year  age
0  2005-09-28  2005   18
1  2007-10-05  2007   16
2  2012-12-20  2012   11